<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Installs the latest version of Docker.</string>
    <key>Identifier</key>
    <string>com.github.chilcote.install.Docker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Docker</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.chilcote.download.Docker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer maintained.
                    See a current Docker repo here:
                    https://github.com/autopkg/smithjw-recipes/tree/master/Docker
                </string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>destination_path</key>
                        <string>/Applications</string>
                        <key>source_item</key>
                        <string>Docker.app</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
        </dict>
    </array>
</dict>
</plist>
